extends Node


var 当前扩展建筑名称
var 当前扩展建筑价格
var 当前扩展建筑人气
var 当前扩展建筑简介


var 当前扩展位置节点
var 当前扩展位置图标放置节点
var 当前建筑状态 = ""
var 图片放置节点按钮 


var 建筑菜单node 


var 扩展位置状态 = {
	"位置" = "",
	"状态" = ""
} 
var 是否确认扩展 = false
#建筑UI自定义变量
var 返回按钮Node 
var 菜单级数 = 0
var 建筑扩展一级菜单连接 = 0
var 建筑扩展二级菜单连接 = 0
var 是否要退出 = false
var 选中的建筑 = {
	"层数" = "",
	"层位置" = "",
	"建筑类型" = "",
	"选择的建筑" = ""
	}




func _process(delta: float) -> void:
	#扩展界面显示
	if "当前扩展建筑名称" != null :
		if 当前扩展建筑名称 in 建筑详情字典: 
			当前扩展建筑价格 = 建筑详情字典[当前扩展建筑名称]["价格"]
			当前扩展建筑人气 = 建筑详情字典[当前扩展建筑名称]["人气"]
			当前扩展建筑简介 = 建筑详情字典[当前扩展建筑名称]["简介"]


var 建筑扩展字典 ={
	"一层": {
		"扩展店面":{
			"1" = "饭店",
			"2" = "",
			"3" = "",
		},
		"景观建筑":{
			"1" = "佛像",
			"2" = "遗迹",
			"3" = "鸟居",
		},
		"其他建筑":{
			"1" = "健身房",
			"2" = "小吃街",
			"3" = "",
		}
	},
	"二层":{
		"扩展店面":{
			"1" = "饭店",
			"2" = "客房",
			"3" = "",
		},
		"景观建筑":{
			"1" = "佛像",
			"2" = "遗迹",
			"3" = "鸟居",
		},
		"其他建筑":{
			"1" = "健身房",
			"2" = "小吃街",
			"3" = "",
		}
	}
}

var 建筑详情字典 = {
	"饭店" :{
		"价格" = 3000 ,
		"人气" = 5 ,
		"简介" = ""
	},
	"客房" :{
		"价格" = 3000 ,
		"人气" = 5 ,
		"简介" = ""
	},
	"佛像" :{
		"价格" = 4000 ,
		"人气" = 8 ,
		"简介" = ""
	},
	"鸟居" :{
		"价格" = 2000 ,
		"人气" = 3 ,
		"简介" = ""
	},
	"遗迹" :{
		"价格" = 5000 ,
		"人气" = 12 ,
		"简介" = ""
	},
	"健身房" :{
		"价格" = 2500 ,
		"人气" = 4 ,
		"简介" = ""
	},
	"小吃街" :{
		"价格" = 4500 ,
		"人气" = 10 ,
		"简介" = ""
	},
}
